tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "railwaycat/emacsmacport"
brew "dnsmasq", restart_service: true
brew "gh"
brew "gradle"
brew "mas"
brew "sdl"
brew "sdl_image"
brew "sdl_mixer"
brew "step"
cask "adobe-acrobat-reader"
cask "amethyst"
cask "android-platform-tools"
cask "caffeine"
cask "docker"
cask "dropbox"
cask "emacs-mac"
cask "firefox"
cask "flux"
cask "font-fira-code-nerd-font"
cask "google-chrome"
cask "grammarly"
cask "intellij-idea-ce"
cask "iterm2"
cask "karabiner-elements"
cask "keybase"
cask "kindle"
cask "lastpass"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "oracle-jdk"
cask "skype"
cask "spectacle"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "zoom"
cask "zotero"
mas "Adblock Plus", id: 1432731683
mas "Bitwarden", id: 1352778147
mas "GarageBand", id: 682658836
mas "Grammarly for Safari", id: 1462114288
mas "HP Easy Scan", id: 967004861
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Octotree", id: 1457450145
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
