tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
brew "glib"
brew "harfbuzz"
brew "mas"
brew "sbt"
brew "scala"
brew "sdl2"
brew "koekeishiya/formulae/skhd", args: ["HEAD"]
cask "amethyst"
cask "caffeine"
cask "docker"
cask "dropbox"
cask "firefox"
cask "font-jetbrains-mono-nerd-font"
cask "google-chrome"
cask "intellij-idea-ce"
cask "iterm2"
cask "karabiner-elements"
cask "kindle"
cask "microsoft-teams"
cask "nightfall"
cask "nomachine"
cask "postman"
cask "racket"
cask "skype"
cask "spectacle"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "zoom"
mas "HP Easy Scan", id: 967004861
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "Numbers", id: 409203825
mas "Tailscale", id: 1475387142
vscode "akamud.vscode-theme-onedark"
vscode "arrterian.nix-env-selector"
vscode "asciidoctor.asciidoctor-vscode"
vscode "bbenoist.Nix"
vscode "dhall.dhall-lang"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "evzen-wybitul.magic-racket"
vscode "fwcd.kotlin"
vscode "georgewfraser.vscode-javac"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.vscode-pull-request-github"
vscode "gitpod.gitpod-remote-ssh"
vscode "Gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "haskell.haskell"
vscode "justusadam.language-haskell"
vscode "leanprover.lean4"
vscode "mathiasfrohlich.Kotlin"
vscode "mkhl.direnv"
vscode "ms-python.black-formatter"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "reduckted.vscode-gitweblinks"
vscode "rubberduck.rubberduck-vscode"
vscode "rust-lang.rust-analyzer"
vscode "scala-lang.scala"
vscode "scalameta.metals"
vscode "tamasfe.even-better-toml"
vscode "twxs.cmake"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "znck.grammarly"
