tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "koekeishiya/formulae"
brew "exercism"
brew "koekeishiya/formulae/skhd", args: ["HEAD"]
cask "amethyst"
cask "caffeine"
cask "docker"
cask "dropbox"
cask "firefox"
cask "font-fontawesome"
cask "font-jetbrains-mono-nerd-font"
cask "google-chrome"
cask "intellij-idea-ce"
cask "iterm2"
cask "karabiner-elements"
cask "kindle"
cask "libreoffice"
cask "microsoft-teams"
cask "nightfall"
cask "nomachine"
cask "notunes"
cask "postman"
cask "skype"
cask "spectacle"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "zoom"
vscode "akamud.vscode-theme-onedark"
vscode "ariesbe.afterdark"
vscode "arrterian.nix-env-selector"
vscode "asciidoctor.asciidoctor-vscode"
vscode "atomiks.moonlight"
vscode "bbenoist.nix"
vscode "dhall.dhall-lang"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "evzen-wybitul.magic-racket"
vscode "faceair.ayu-one-dark"
vscode "flix.flix"
vscode "freecodecamp.freecodecamp-dark-vscode-theme"
vscode "fwcd.kotlin"
vscode "georgewfraser.vscode-javac"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "gitpod.gitpod-remote-ssh"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "haskell.haskell"
vscode "justusadam.language-haskell"
vscode "leanprover.lean4"
vscode "mathiasfrohlich.kotlin"
vscode "mkhl.direnv"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "nimda.deepdark-material"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "reduckted.vscode-gitweblinks"
vscode "rubberduck.rubberduck-vscode"
vscode "rust-lang.rust-analyzer"
vscode "scala-lang.scala"
vscode "scalameta.metals"
vscode "silofy.hackthebox"
vscode "ssmi.after-dark"
vscode "tamasfe.even-better-toml"
vscode "thedavej.night-owl-black"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "znck.grammarly"
